---
kind: other
id: Properties.T:Autodesk.Revit.DB.BuiltInFailures.BeamSystemFailures
source: html/ff91a340-0a31-6f06-450c-00b4ce0b6cd9.htm
---
# BuiltInFailures.BeamSystemFailures Properties

Beam of user-defined type does not fit into beam system with clear spacing layout rule. Beam type is reset to default.